In [1]:
#import Dependencies
import pandas as pd
from sqlalchemy import create_engine

In [2]:
ebola_file = "Resources/ebola_2014_2016_clean.csv"
ebola_df = pd.read_csv(ebola_file)
ebola_df.head()

#read in CSV file into the notebook

,Country,Date,No. of suspected cases,No. of probable cases,No. of confirmed cases,"No. of confirmed, probable and suspected cases",No. of suspected deaths,No. of probable deaths,No. of confirmed deaths,"No. of confirmed, probable and suspected deaths",Tpye
0,Guinea,8/29/2014,25.0,141.0,482.0,648.0,2.0,141.0,287.0,430,Ebola
1,Nigeria,8/29/2014,3.0,1.0,15.0,19.0,0.0,1.0,6.0,7,Ebola
2,Sierra Leone,8/29/2014,54.0,37.0,935.0,1026.0,8.0,34.0,380.0,422,Ebola
3,Liberia,8/29/2014,382.0,674.0,322.0,1378.0,168.0,301.0,225.0,694,Ebola
4,Sierra Leone,9/5/2014,78.0,37.0,1146.0,1261.0,11.0,37.0,443.0,491,Ebola

In [3]:
ebola_cols = ["Country","Date","No. of confirmed cases","No. of confirmed deaths","Tpye "]
print(ebola_cols)

#created index of columns from the dataset that we want to use

['Country', 'Date', 'No. of confirmed cases', 'No. of confirmed deaths', 'Tpye ']

In [4]:
# ebola_df.columns

In [5]:
ebola_transformed= ebola_df[ebola_cols].copy()

print(ebola_transformed)

#transformation of data, used the DataFrame that was created, using the index of columns that we wanted to look at

                       Country       Date  No. of confirmed cases  \
0                       Guinea  8/29/2014                   482.0
1                      Nigeria  8/29/2014                    15.0
2                 Sierra Leone  8/29/2014                   935.0
3                      Liberia  8/29/2014                   322.0
4                 Sierra Leone   9/5/2014                  1146.0
...                        ...        ...                     ...
2480                   Liberia  3/23/2016                  3151.0
2481                     Italy  3/23/2016                     1.0
2482                   Liberia  3/23/2016                     2.0
2483                   Nigeria  3/23/2016                    19.0
2484  United States of America  3/23/2016                     4.0

      No. of confirmed deaths  Tpye
0                       287.0  Ebola
1                         6.0  Ebola
2                       380.0  Ebola
3                       225.0  Ebola
4                       443.0  Ebola
...                       ...    ...
2480                      NaN  Ebola
2481                      NaN  Ebola
2482                      1.0  Ebola
2483                      7.0  Ebola
2484                      1.0  Ebola

[2485 rows x 5 columns]

In [6]:
ebola_transformed = ebola_transformed.rename(columns={"Country":"Country",
                                              "Date":"Date",
                                              "No. of confirmed cases":"Confirmed_Cases",
                                              "No. of confirmed deaths":"Confirmed_Deaths",
                                              "Tpye ":"Type"
    
})
ebola_transformed.head()

#renamed the columns in transformed dataset to be able to match other datasets that we were going to use

        Country       Date  Confirmed_Cases  Confirmed_Deaths   Type
0        Guinea  8/29/2014            482.0             287.0  Ebola
1       Nigeria  8/29/2014             15.0               6.0  Ebola
2  Sierra Leone  8/29/2014            935.0             380.0  Ebola
3       Liberia  8/29/2014            322.0             225.0  Ebola
4  Sierra Leone   9/5/2014           1146.0             443.0  Ebola

In [7]:
nCoV_file = "Resources/2019_nCoV_data.csv"
nCoV_df = pd.read_csv(nCoV_file)
nCoV_df.head()

#read in CSV file into the notebook

,Sno,Date,Province/State,Country,Last Update,Confirmed,Deaths,Recovered,Type
0,1,1/22/2020 12:00,Anhui,China,1/22/2020 12:00,1,0,0,CoroaVirus
1,2,1/22/2020 12:00,Beijing,China,1/22/2020 12:00,14,0,0,CoroaVirus
2,3,1/22/2020 12:00,Chongqing,China,1/22/2020 12:00,6,0,0,CoroaVirus
3,4,1/22/2020 12:00,Fujian,China,1/22/2020 12:00,1,0,0,CoroaVirus
4,5,1/22/2020 12:00,Gansu,China,1/22/2020 12:00,0,0,0,CoroaVirus

In [8]:
nCoV_cols = ["Country","Date","Confirmed","Deaths","Type"]
print(nCoV_cols)

#created index of columns from the dataset that we want to use

['Country', 'Date', 'Confirmed', 'Deaths', 'Type']

In [9]:
nCoV_transformed= nCoV_df[nCoV_cols].copy()

print(nCoV_transformed)

#transformation of data, used the DataFrame that was created, using the index of columns that we wanted to look at

     Country             Date  Confirmed  Deaths        Type
0      China  1/22/2020 12:00          1       0  CoroaVirus
1      China  1/22/2020 12:00         14       0  CoroaVirus
2      China  1/22/2020 12:00          6       0  CoroaVirus
3      China  1/22/2020 12:00          1       0  CoroaVirus
4      China  1/22/2020 12:00          0       0  CoroaVirus
...      ...              ...        ...     ...         ...
1714      US  2/17/2020 22:00          1       0  CoroaVirus
1715      US  2/17/2020 22:00          1       0  CoroaVirus
1716      US  2/17/2020 22:00          1       0  CoroaVirus
1717      US  2/17/2020 22:00          1       0  CoroaVirus
1718      US  2/17/2020 22:00          1       0  CoroaVirus

[1719 rows x 5 columns]

In [10]:
nCoV_transformed = nCoV_transformed.rename(columns={"Country":"Country",
                                              "Date":"Date",
                                              "Confirmed":"Confirmed_Cases",
                                              "Deaths":"Confirmed_Deaths",
                                              "Type":"Type"
    
})
nCoV_transformed.head()

#renamed the columns in transformed dataset to be able to match other datasets that we were going to use

  Country             Date  Confirmed_Cases  Confirmed_Deaths        Type
0   China  1/22/2020 12:00                1                 0  CoroaVirus
1   China  1/22/2020 12:00               14                 0  CoroaVirus
2   China  1/22/2020 12:00                6                 0  CoroaVirus
3   China  1/22/2020 12:00                1                 0  CoroaVirus
4   China  1/22/2020 12:00                0                 0  CoroaVirus

In [11]:
sars_file = "Resources/sars_2003_complete_dataset_clean.csv"
sars_df = pd.read_csv(sars_file)
sars_df.head()

#read in CSV file into the notebook

,Date,Country,Cumulative number of case(s),Number of deaths,Number recovered,type
0,3/17/2003,Germany,1,0,0,sars
1,3/17/2003,Canada,8,2,0,sars
2,3/17/2003,Singapore,20,0,0,sars
3,3/17/2003,"Hong Kong SAR, China",95,1,0,sars
4,3/17/2003,Switzerland,2,0,0,sars

In [12]:
sars_cols = ["Date", "Country", "Cumulative number of case(s)", "Number of deaths", "type"]

sars_transformed= sars_df[sars_cols].copy()

print(sars_transformed)

#created index of columns from the dataset that we want to use

           Date               Country  Cumulative number of case(s)  \
0     3/17/2003               Germany                             1
1     3/17/2003                Canada                             8
2     3/17/2003             Singapore                            20
3     3/17/2003  Hong Kong SAR, China                            95
4     3/17/2003           Switzerland                             2
...         ...                   ...                           ...
2533  7/11/2003           Switzerland                             1
2534  7/11/2003              Thailand                             9
2535  7/11/2003        United Kingdom                             4
2536  7/11/2003         United States                            75
2537  7/11/2003              Viet Nam                            63

      Number of deaths  type
0                    0  sars
1                    2  sars
2                    0  sars
3                    1  sars
4                    0  sars
...                ...   ...
2533                 0  sars
2534                 2  sars
2535                 0  sars
2536                 0  sars
2537                 5  sars

[2538 rows x 5 columns]

In [13]:
sars_df.columns

Index(['Date', 'Country', 'Cumulative number of case(s)', 'Number of deaths',
       'Number recovered', 'type'],
      dtype='object')

In [14]:
sars_transformed = sars_transformed.rename(columns={"Country":"Country",
                                              "Date_":"Date",
                                              "Cumulative number of case(s)":"Confirmed_Cases",
                                              "Number of deaths":"Confirmed_Deaths",
                                              "type":"Type"
    
})

sars_transformed.head()

#transformation of data, used the DataFrame that was created, using the index of columns that we wanted to look at

        Date               Country  Confirmed_Cases  Confirmed_Deaths  Type
0  3/17/2003               Germany                1                 0  sars
1  3/17/2003                Canada                8                 2  sars
2  3/17/2003             Singapore               20                 0  sars
3  3/17/2003  Hong Kong SAR, China               95                 1  sars
4  3/17/2003           Switzerland                2                 0  sars

In [15]:
sars_transformed["Country"].replace({"Hong Kong SAR, China": "China"}).head()

#replaced Hong Kong SAR, China in the country column to just say China to match our other datasets

0        Germany
1         Canada
2      Singapore
3          China
4    Switzerland
Name: Country, dtype: object

In [16]:
connection_string = "etl:etl@localhost:5432/ETL_db"
engine = create_engine(f'postgresql://{connection_string}')

#connected to SQL database PGAdmin

In [25]:
engine.table_names()

#ran the engine to show table names that had been created within the database

['ebola', 'ncov', 'Virus_data', 'nCoV', 'sar', 'virus_data']

In [31]:
ebola_transformed.to_sql(name='ebola', con=engine, if_exists='replace',index=True)

#uploaded transformed datasets to SQL table

In [27]:
nCoV_transformed.to_sql(name='ncov',con=engine, if_exists='append', index=True)

#uploaded transformed datasets to SQL table

In [32]:
sars_transformed.to_sql(name='sar', con=engine, if_exists='replace', index=True)

#uploaded transformed datasets to SQL table

In [21]:
df_new= pd.concat([sars_transformed,nCoV_transformed,ebola_transformed])

#created a new DataFrame in order to combine the three transformed datasets

C:\Users\stacy\Anaconda3\lib\site-packages\ipykernel_launcher.py:1: FutureWarning: Sorting because non-concatenation axis is not aligned. A future version
of pandas will change to not sort by default.

To accept the future behavior, pass 'sort=False'.

To retain the current behavior and silence the warning, pass 'sort=True'.

  """Entry point for launching an IPython kernel.

In [22]:
df_new

,Confirmed_Cases,Confirmed_Deaths,Country,Date,Type
0,1.0,0.0,Germany,3/17/2003,sars
1,8.0,2.0,Canada,3/17/2003,sars
2,20.0,0.0,Singapore,3/17/2003,sars
3,95.0,1.0,"Hong Kong SAR, China",3/17/2003,sars
4,2.0,0.0,Switzerland,3/17/2003,sars
...,...,...,...,...,...
2480,3151.0,NaN,Liberia,3/23/2016,Ebola
2481,1.0,NaN,Italy,3/23/2016,Ebola
2482,2.0,1.0,Liberia,3/23/2016,Ebola
2483,19.0,7.0,Nigeria,3/23/2016,Ebola
2484,4.0,1.0,United States of America,3/23/2016,Ebola

In [23]:
grouped=df_new.groupby(['Type','Country']).sum()
grouped

#grouped transformed datasets by type of virus and country to cleant the data

                           Confirmed_Cases  Confirmed_Deaths
Type       Country
CoroaVirus Australia                 284.0               0.0
           Belgium                    14.0               0.0
           Brazil                      0.0               0.0
           Cambodia                   22.0               0.0
           Canada                    116.0               0.0
...                                    ...               ...
sars       Taiwan, China           30373.0            3550.0
           Thailand                  697.0             167.0
           United Kingdom            414.0               0.0
           United States            7206.0               0.0
           Viet Nam                 5885.0             438.0

[81 rows x 2 columns]

In [24]:
grouped.to_sql(name='Virus_data',con=engine, if_exists='append', index=True)

#loaded grouped data into Virus_data table which is the combined, transformed dataset

In [34]:
with pd.option_context('display.max_rows', None, 'display.max_columns', None):
    print(grouped)
    
#all data is being displayed

                                     Confirmed_Cases  Confirmed_Deaths
Type       Country
CoroaVirus Australia                           284.0               0.0
           Belgium                              14.0               0.0
           Brazil                                0.0               0.0
           Cambodia                             22.0               0.0
           Canada                              116.0               0.0
           China                               549.0               0.0
           Egypt                                 4.0               0.0
           Finland                              20.0               0.0
           France                              186.0               3.0
           Germany                             252.0               0.0
           Hong Kong                           681.0              14.0
           India                                50.0               0.0
           Italy                                49.0               0.0
           Ivory Coast                           0.0               0.0
           Japan                               591.0               5.0
           Macau                               209.0               0.0
           Mainland China                   772951.0           17908.0
           Malaysia                            303.0               0.0
           Mexico                                0.0               0.0
           Nepal                                24.0               0.0
           Others                             2161.0               0.0
           Philippines                          47.0              17.0
           Russia                               36.0               0.0
           Singapore                           797.0               0.0
           South Korea                         444.0               0.0
           Spain                                27.0               0.0
           Sri Lanka                            22.0               0.0
           Sweden                               18.0               0.0
           Taiwan                              320.0               2.0
           Thailand                            581.0               0.0
           UK                                   93.0               0.0
           US                                  250.0               0.0
           United Arab Emirates                126.0               0.0
           Vietnam                             225.0               0.0
Ebola      Guinea                           749622.0          461211.0
           Italy                               141.0               0.0
           Liberia                          768738.0           26937.0
           Mali                               1658.0              21.0
           Nigeria                            4840.0            1784.0
           Senegal                             254.0               0.0
           Sierra Leone                    2041871.0          797984.0
           Spain                               243.0               0.0
           United Kingdom                      221.0               0.0
           United States of America            967.0             242.0
sars       Australia                            49.0               0.0
           Belgium                               5.0               0.0
           Brazil                              162.0               0.0
           Bulgaria                             20.0               0.0
           Canada                            14249.0            2015.0
           China                            343093.0           19738.0
           Colombia                             53.0               0.0
           Finland                              51.0               0.0
           France                              504.0               1.0
           Germany                             725.0               0.0
           Hong Kong SAR, China             132776.0           16924.0
           India                               158.0               0.0
           Indonesia                           130.0               0.0
           Italy                               577.0               0.0
           Japan                                45.0               0.0
           Kuwait                               75.0               0.0
           Macao SAR, China                     64.0               0.0
           Malaysia                            420.0             143.0
           Mongolia                            551.0               0.0
           New Zealand                          56.0               0.0
           Philippines                         702.0             127.0
           Poland                               10.0               0.0
           Republic of Ireland                  99.0               0.0
           Republic of Korea                   153.0               0.0
           Romania                              99.0               0.0
           Russian Federation                   31.0               0.0
           Singapore                         16428.0            2052.0
           Slovenia                              5.0               0.0
           South Africa                         74.0              54.0
           Spain                                86.0               0.0
           Sweden                              208.0               0.0
           Switzerland                         127.0               0.0
           Taiwan, China                     30373.0            3550.0
           Thailand                            697.0             167.0
           United Kingdom                      414.0               0.0
           United States                      7206.0               0.0
           Viet Nam                           5885.0             438.0